Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC8B.xml
        <register name="SDR0" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Sample Data Register 0">
          <bitfield name="DATA" caption="Sample Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDR1" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Sample Data Register 1">
          <bitfield name="DATA" caption="Sample Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="VCR0" offset="0xc" rw="RW" size="4" initval="0x00000000" caption="Volume Control Register 0">
          <bitfield name="VOLUME" caption="Volume Control" mask="0x7FFF"/>
          <bitfield name="MUTE" caption="Mute" mask="0x80000000"/>
        </register>
        <register name="VCR1" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Volume Control Register 1">
          <bitfield name="VOLUME" caption="Volume Control" mask="0x7FFF"/>
          <bitfield name="MUTE" caption="Mute" mask="0x80000000"/>
        </register>
        <register name="IER" offset="0x14" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Enable" mask="0x2" values="ABDACB_IER__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun Interrupt Enable" mask="0x4" values="ABDACB_IER__TXUR"/>
        </register>
        <register name="IDR" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Interupt Disable Register">
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Disable" mask="0x2" values="ABDACB_IDR__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun Interrupt Disable" mask="0x4" values="ABDACB_IDR__TXUR"/>
        </register>
        <register name="IMR" offset="0x1c" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Mask" mask="0x2" values="ABDACB_IMR__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun Interrupt Mask" mask="0x4" values="ABDACB_IMR__TXUR"/>
        </register>
        <register name="SR" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="BUSY" caption="ABDACB Busy" mask="0x1"/>
          <bitfield name="TXRDY" caption="Transmit Ready" mask="0x2" values="ABDACB_SR__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun" mask="0x4" values="ABDACB_SR__TXUR"/>
        </register>
        <register name="SCR" offset="0x24" rw="W" size="4" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Clear" mask="0x2" values="ABDACB_SCR__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun Interrupt Clear" mask="0x4" values="ABDACB_SCR__TXUR"/>
        </register>
        <register name="PARAMETER" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Parameter Register">
        </register>
        <register name="VERSION" offset="0x2c" rw="R" size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="ABDACB_CR__EN">
        <value name="0" caption="Audio DAC is disabled" value="0"/>
        <value name="1" caption="Audio DAC is enabled" value="1"/>
      </value-group>
      <value-group name="ABDACB_CR__SWAP">
        <value name="0" caption="The CHANNEL0 and CHANNEL1 samples will not be swapped when writing the Audio DAC Sample Data Register (SDR)" value="0"/>
        <value name="1" caption="The CHANNEL0 and CHANNEL1 samples will be swapped when writing the Audio DAC Sample Data Register (SDR)" value="1"/>
      </value-group>
      <value-group name="ABDACB_IER__TXRDY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enables the Audio DAC TX Ready interrupt" value="1"/>
      </value-group>
      <value-group name="ABDACB_IER__TXUR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enables the Audio DAC Underrun interrupt" value="1"/>
      </value-group>
      <value-group name="ABDACB_IDR__TXRDY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable the Audio DAC TX Ready interrupt" value="1"/>
      </value-group>
      <value-group name="ABDACB_IDR__TXUR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable the Audio DAC Underrun interrupt" value="1"/>
      </value-group>
      <value-group name="ABDACB_IMR__TXRDY">
        <value name="0" caption="The Audio DAC TX Ready interrupt is disabled" value="0"/>
        <value name="1" caption="The Audio DAC TX Ready interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="ABDACB_IMR__TXUR">
        <value name="0" caption="The Audio DAC Underrun interrupt is disabled" value="0"/>
        <value name="1" caption="The Audio DAC Underrun interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="ABDACB_SR__TXRDY">
        <value name="0" caption="No Audio DAC TX Ready has occured since the last time ISR was read or since reset" value="0"/>
        <value name="1" caption="At least one Audio DAC TX Ready has occured since the last time ISR was read or since reset" value="1"/>
      </value-group>
      <value-group name="ABDACB_SR__TXUR">
        <value name="0" caption="No Audio DAC Underrun has occured since the last time ISR was read or since reset" value="0"/>
        <value name="1" caption="At least one Audio DAC Underrun has occured since the last time ISR was read or since reset" value="1"/>
      </value-group>
      <value-group name="ABDACB_SCR__TXRDY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Clear the Audio DAC TX Ready interrupt" value="1"/>
      </value-group>
