Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC8B.xml
        <register name="PARAMETER" offset="0x1F8" rw="R" size="4" caption="Parameter Register">
          <bitfield name="PARAMETER" caption="Parameter" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x1FC" rw="R" size="4" initval="0x00000215" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <register-group name="GPIO" caption="General-Purpose Input/Output Controller">
        <register-group name="port" name-in-module="port" offset="0x000" count="3" count-param="PORT_LENGTH"/>
      </register-group>
    </module>
    <module name="HCACHE" id="I8323" version="1.0.1" caption="Cortex M I&amp;D Cache Controller">
      <register-group name="HCACHE" caption="Cortex M I&amp;D Cache Controller">
        <register name="CTRL" offset="0x8" rw="W" size="4" caption="Control Register">
          <bitfield name="CEN" caption="Cache Enable" mask="0x1" values="HCACHE_CTRL__CEN"/>
        </register>
        <register name="SR" offset="0xc" rw="RW" size="4" caption="Status Register">
          <bitfield name="CSTS" caption="Cache Controller Status" mask="0x1" values="HCACHE_SR__CSTS"/>
        </register>
        <register name="MAINT0" offset="0x20" rw="W" size="4" caption="Maintenance Register 0">
          <bitfield name="INVALL" caption="Cache Controller Invalidate All" mask="0x1" values="HCACHE_MAINT0__INVALL"/>
        </register>
        <register name="MAINT1" offset="0x24" rw="W" size="4" caption="Maintenance Register 1">
          <bitfield name="INDEX" caption="Invalidate Index" mask="0xF0"/>
        </register>
        <register name="MCFG" offset="0x28" rw="RW" size="4" caption="Monitor Configuration Register">
          <bitfield name="MODE" caption="Cache Controller Monitor Counter Mode" mask="0x3" values="HCACHE_MCFG__MODE"/>
        </register>
        <register name="MEN" offset="0x2c" rw="RW" size="4" caption="Monitor Enable Register">
          <bitfield name="MENABLE" caption="Monitor Enable" mask="0x1" values="HCACHE_MEN__MENABLE"/>
        </register>
        <register name="MCTRL" offset="0x30" rw="W" size="4" caption="Monitor Control Register">
          <bitfield name="SWRST" caption="Monitor Software Reset" mask="0x1" values="HCACHE_MCTRL__SWRST"/>
        </register>
        <register name="MSR" offset="0x34" rw="R" size="4" caption="Monitor Status Register">
          <bitfield name="EVENTCNT" caption="Monitor Event Counter" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0xfc" rw="R" size="4" initval="0x00000101" caption="Version Register">
          <bitfield name="VERSION" caption="VERSION" mask="0xFFF"/>
          <bitfield name="MFN" caption="MFN" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="HCACHE_CTRL__CEN">
        <value name="NO" caption="Disable Cache Controller" value="0"/>
        <value name="YES" caption="Enable Cache Controller" value="1"/>
      </value-group>
      <value-group name="HCACHE_SR__CSTS">
        <value name="DIS" caption="Cache Controller Disabled" value="0"/>
        <value name="EN" caption="Cache Controller Enabled" value="1"/>
      </value-group>
      <value-group name="HCACHE_MAINT0__INVALL">
        <value name="NO" caption="No effect" value="0"/>
        <value name="YES" caption="Invalidate all cache entries" value="1"/>
      </value-group>
      <value-group name="HCACHE_MCFG__MODE">
        <value name="CYCLE" caption="Cycle Counter" value="0"/>
        <value name="IHIT" caption="Instruction Hit Counter" value="1"/>
        <value name="DHIT" caption="Data Hit Counter" value="2"/>
      </value-group>
      <value-group name="HCACHE_MEN__MENABLE">
        <value name="DIS" caption="Disable Monitor Counter" value="0"/>
        <value name="EN" caption="Enable Monitor Counter" value="1"/>
      </value-group>
      <value-group name="HCACHE_MCTRL__SWRST">
        <value name="NO" caption="No effect" value="0"/>
        <value name="YES" caption="Reset event counter register" value="1"/>
      </value-group>
    </module>
    <module name="HMATRIXB" id="I7638" version="1.3.0" caption="HSB Matrix">
      <register-group name="prs" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Priority Register A for Slave">
          <bitfield name="M0PR" caption="Master 0 Priority" mask="0xF"/>
          <bitfield name="M1PR" caption="Master 1 Priority" mask="0xF0"/>
          <bitfield name="M2PR" caption="Master 2 Priority" mask="0xF00"/>
          <bitfield name="M3PR" caption="Master 3 Priority" mask="0xF000"/>
          <bitfield name="M4PR" caption="Master 4 Priority" mask="0xF0000"/>
          <bitfield name="M5PR" caption="Master 5 Priority" mask="0xF00000"/>
          <bitfield name="M6PR" caption="Master 6 Priority" mask="0xF000000"/>
          <bitfield name="M7PR" caption="Master 7 Priority" mask="0xF0000000"/>
        </register>
        <register name="PRBS" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Priority Register B for Slave">
          <bitfield name="M8PR" caption="Master 8 Priority" mask="0xF"/>
          <bitfield name="M9PR" caption="Master 9 Priority" mask="0xF0"/>
          <bitfield name="M10PR" caption="Master 10 Priority" mask="0xF00"/>
          <bitfield name="M11PR" caption="Master 11 Priority" mask="0xF000"/>
          <bitfield name="M12PR" caption="Master 12 Priority" mask="0xF0000"/>
          <bitfield name="M13PR" caption="Master 13 Priority" mask="0xF00000"/>
          <bitfield name="M14PR" caption="Master 14 Priority" mask="0xF000000"/>
          <bitfield name="M15PR" caption="Master 15 Priority" mask="0xF0000000"/>
        </register>
      </register-group>
      <register-group name="HMATRIXB" caption="HSB Matrix">
        <register name="MCFG" offset="0x0" rw="RW" size="4" count="16" initval="0x00000002" caption="Master Configuration Register">
          <bitfield name="ULBT" caption="Undefined Length Burst Type" mask="0x7" values="HMATRIXB_MCFG__ULBT"/>
        </register>
        <register name="SCFG" offset="0x40" rw="RW" size="4" count="16" initval="0x00000010" caption="Slave Configuration Register">
          <bitfield name="SLOT_CYCLE" caption="Maximum Number of Allowed Cycles for a Burst" mask="0xFF"/>
          <bitfield name="DEFMSTR_TYPE" caption="Default Master Type" mask="0x30000" values="HMATRIXB_SCFG__DEFMSTR_TYPE"/>
          <bitfield name="FIXED_DEFMSTR" caption="Fixed Index of Default Master" mask="0x3C0000"/>
          <bitfield name="ARBT" caption="Arbitration Type" mask="0x1000000" values="HMATRIXB_SCFG__ARBT"/>
        </register>
        <register-group name="prs" name-in-module="prs" offset="0x080" count="16"/>
        <register name="MRCR" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="Master Remap Control Register">
          <bitfield name="RCB0" caption="Remap Command bit for Master 0" mask="0x1" values="HMATRIXB_MRCR__RCB0"/>
          <bitfield name="RCB1" caption="Remap Command bit for Master 1" mask="0x2" values="HMATRIXB_MRCR__RCB1"/>
          <bitfield name="RCB2" caption="Remap Command bit for Master 2" mask="0x4" values="HMATRIXB_MRCR__RCB2"/>
          <bitfield name="RCB3" caption="Remap Command bit for Master 3" mask="0x8" values="HMATRIXB_MRCR__RCB3"/>
          <bitfield name="RCB4" caption="Remap Command bit for Master 4" mask="0x10" values="HMATRIXB_MRCR__RCB4"/>
          <bitfield name="RCB5" caption="Remap Command bit for Master 5" mask="0x20" values="HMATRIXB_MRCR__RCB5"/>
          <bitfield name="RCB6" caption="Remap Command bit for Master 6" mask="0x40" values="HMATRIXB_MRCR__RCB6"/>
          <bitfield name="RCB7" caption="Remap Command bit for Master 7" mask="0x80" values="HMATRIXB_MRCR__RCB7"/>
          <bitfield name="RCB8" caption="Remap Command bit for Master 8" mask="0x100" values="HMATRIXB_MRCR__RCB8"/>
          <bitfield name="RCB9" caption="Remap Command bit for Master 9" mask="0x200" values="HMATRIXB_MRCR__RCB9"/>
          <bitfield name="RCB10" caption="Remap Command bit for Master 10" mask="0x400" values="HMATRIXB_MRCR__RCB10"/>
          <bitfield name="RCB11" caption="Remap Command bit for Master 11" mask="0x800" values="HMATRIXB_MRCR__RCB11"/>
          <bitfield name="RCB12" caption="Remap Command bit for Master 12" mask="0x1000" values="HMATRIXB_MRCR__RCB12"/>
          <bitfield name="RCB13" caption="Remap Command bit for Master 13" mask="0x2000" values="HMATRIXB_MRCR__RCB13"/>
          <bitfield name="RCB14" caption="Remap Command bit for Master 14" mask="0x4000" values="HMATRIXB_MRCR__RCB14"/>
          <bitfield name="RCB15" caption="Remap Command bit for Master 15" mask="0x8000" values="HMATRIXB_MRCR__RCB15"/>
        </register>
        <register name="SFR" offset="0x110" rw="RW" size="4" count="16" initval="0x00000000" caption="Special Function Register">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
