Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC8B.xml
        <register name="UPSTA3CLR" offset="0x56c" rw="W" size="4" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA4CLR" offset="0x570" rw="W" size="4" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA5CLR" offset="0x574" rw="W" size="4" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA6CLR" offset="0x578" rw="W" size="4" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA7CLR" offset="0x57c" rw="W" size="4" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA0SET" offset="0x590" rw="W" size="4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA1SET" offset="0x594" rw="W" size="4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA2SET" offset="0x598" rw="W" size="4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA3SET" offset="0x59c" rw="W" size="4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA4SET" offset="0x5a0" rw="W" size="4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
